export default {
    aboutme: [
        "我是来自于乌鲁木齐的前端开发工程师，2017年毕业于天津职业大学，2017年9月份开始第一份前端开发工作，至今已经有两年前端开发经验。",
        "有着坚实的前端开发基础，并且一直保持对新技术的学习热情。熟练使用HTML5、CSS3以及JavaScript；对流行的前端开发框架，比如vue有实际开发项目；能熟练使用前端开发工具，比如Postman、WebPack和scss等等；自学习了HTML,CSS3,Javascript,jQuery,Vue与React，但更加喜欢轻巧、高性能、可组件化的MVVM框架Vue.js，并在实际的开发项目中使用；学习了Node.js(Express)、ECMAScript6，MongoDB等技术，希望在往后的开发项目中得到实践提升。",
        "乐于学习先进前沿的技术，活跃在GitHub上，学习过不少开源的项目，并且总结过一些学习技巧,而且有一个自己常用的JS库。希望自己的技术能越来越好。",
        "爱读书，爱听歌，爱旅游，爱猫咪，爱烹饪。代码不是生活的全部。",
    ],

    skillText:
        "前端开发需要一个持续和长期的学习，需要在各种领域都有充足的知识储备，需要对新技术的学习保持热情。前端开发工程师技术栈中最重要的就是原生JavaScript,并长时间在网上攻读此类的博客等,最近刚开始学习Typescript",
    skill: [
        "HTML5",
        "CSS3",
        "JavasSript",
        "jQuery",
        "Vue.js",
        "React",
        "Less/scss",
        "Typescript",
        "ECMAScript 6",
    ],

    experienceText:
        "2017年6月，毕业于天津职业大学，2016年10月在学校第一次实习结束回来后,发现没有技术真的很难，并且自己对电脑程序等很感兴趣，本着能做黑客的想法开始接触编程。我并不是一个科班出身的人员，但是我一直坚信只要自己肯努力，是金子总会给发光的，我学习的途径主要是在网上找一些视频从基础的学期，并且慢慢跟着敲代码，刚开始没有经验的确很难学会，但是我们有放弃，坚持了半年左右发现自己也是可以学会的，并且开始自己模仿别人网站进行练习，以提升提升自己的前端开发技能和经验。并且在毕业之后也进入朋友在的公司进行真正的开发，也学习到了很多东西，前端的路很长，我才刚刚起步，我希望能学得更多，在工作中能遇到挚友，一起进步",
    experience: [
        {
            company: "广州市本该科技有限责任公司",
            job: "web前端工程师",
            reap:
                "这段时间是自己前端开发技能得到不少提高的阶段。自己是公司的小白前端前端，公司的官网、日常的运营页面、新项目的开发我都有参与学习。工作非常饱和，但是在闲暇时候抽空学了很多新的框架和库，对Vue和React有了一定的了解，而选择了轻巧、高性能、可组件化的Vue.js作为主攻的MVVM框架，开始涉及WebPack，ECMAScript6，Node.js(Express)等的学习，熟练使用npm、yarn等工具。",
            beginTime: "2017-07",
            endTime: "2019-09",
        },
    ],

    project: [
        {
            beginTime: "2019-03",
            endTime: "2019-08",
            proName: "芝麻加油站(Vue)",
            period: "2个月+更新迭代到离职",
            describe:
                "芝麻加油站是主做汽车加油的程序，通过获取用户的定位并且通过合作加油站自行进行加油服务。",
            science: [
                "运用vue的写法进行开发，提高了开发的效率",
                "运用其自带的api封装好的接口用原生js调取，进行开发",
                "运用vuex进行组件数据的传递存储",
                "运用axios,并且进行二次封装,进行与后端的数据交互，从而渲染页面",
                "模块化开发思想,封装公共组件，通过props传值提高复用率",
            ],
            obligation:
                "我在该项目中负责前端的工作,包括静态的制作,网络请求与后台的交互,处理api接口实现交互效果及后期的维护等。",
        },
        {
            beginTime: "2018.09",
            endTime: "2018.12",
            proName: "公司商品后台管理系统(Vue)",
            period: "3个月",
            describe:
                "新增了业务,要弄一个后台管理系统，把之前的后台管理系统彻底重新整合起来，是一个集商城,加油,违章,油耗,用户信息,商家信息等的后台系统",
            science: [
                "运用vue-cli脚手架进行的项目开发",
                "运用vue-router进行路由的跳转,并且使用路由懒加载,路由守卫等进行优化,提高用户的体验",
                "运用vuex管理全局的状态，进行组间之间的通信",
                "运用axios,进行与后端的数据骄交互",
                "运用了网上的element UI提高开发效率等",
                "运用到了token技术,加强安全性,实现功能预渲染",
            ],
            obligation:
                "该项目是团队开发项目，负责公司的后台管理页面,我在其中负责的是路由的设置，以及用户信息，优惠卷，商品页面等界面的开发",
        },
        {
            beginTime: "2018.06",
            endTime: "2018.08",
            proName: "查违章(Vue)",
            period: "1个月+后期慢慢维护更新迭代",
            describe:
                "基于之前新增加的模块,查违章,用户可以自行通过手机查询进行车辆的违章知晓",
            science: [
                "运用vue进行的单页面开发",
                "运用axios通过监听输入框信息然后传递后台查询信息渲染的技术",
                "运用div+css进行静态页面的开发",
            ],
            obligation:
                "该项目是个人开发项目,负责所有页面,该项目,我认为最麻烦的在于键盘的制作,应产品经理要求,不能用自带键盘,不能用input,所以在这里浪费了些许时间",
        },
        {
            beginTime: "2018.03",
            endTime: "2018.06",
            proName: "芝麻加油商城(Vue)",
            period: "3个月+后期慢慢维护更新迭代",
            describe: "该项目是对自己公司商品的售卖进行手机端的开发",
            science: [
                "运用vue进行项目开发",
                "运用了scss进行预编译提高开发效率",
                "运用了有赞集团的vantUI提高页面效果，提高开发效率，提高用户体验",
                "运用vuex进行全局的状态管理",
                "运用了ES6规范等",
                "运用了路由跳转等技术",
            ],
            obligation:
                "该项目是团队开发项目,负责首页,列表页,详情页，购物车等页面",
        },
        {
            beginTime: "2017.09",
            endTime: "2017.12",
            proName: "芝麻加油官网(PC+jQuery)",
            period: "3个月",
            describe: "该项目是对公司官网的制作",
            science: [
                "运用jQuery进行项目开发",
                "运用了bootstrap提高开发效率",
                "运用了Ajax的封装，进行与后端的数据交互",
                "运用了ES6规范,css3等技术",
            ],
            obligation:
                "该项目是团队开发项目,负责首页,成为车主页面等页面的开发",
        },
    ],

    touch: [
        "作为一个真正的程序员",
        "首先应该尊重编程",
        "热爱你所写下的程序",
        "他是你的伙伴",
        "而不是工具",
    ],

    inf: ["email: he960301@163.com"],
};
